Repository: common-repository/mtasku-payment-for-woocommerce
Catalog: locale/woocommerce-payment-telia-mtasku-*.po
Languages: et

source: WooCommerce Telia mTasku payment gateway
et: WooCommerce Telia mTasku maksevärav

source: Method availability
et: Maksemeetodi saadavus

source: All allowed countries
et: Kõik lubatud riigid

source: Specific Countries
et: Valitud riigid

source: Enable/Disable
et: Luba/Keela

source: Enable mTasku payments
et: Luba klientidele mTasku maksed

source: Title
et: Nimetus

source: This controls the title which the user sees during checkout.
et: Muudab makseviisi nimetust, mida klient näeb kassas.

source: mTasku mobile wallet
et: mTasku mobiilne rahakott

source: Description
et: Kirjeldus

source: This controls the description which the user sees during checkout.
et: Muudab makseviisi kirjeldust, kui klient valib käesoleva makseviisi.

source: Merchant username/registration code
et: Kaupmehe kasutajanimi/registrikood

source: https://www.mtasku.ee/en/sooviavaldus/
et: https://www.mtasku.ee/sooviavaldus/

source: Merchant password
et: Kaupmehe salasõna

source: Merchant terminal ID
et: Kaupmehe terminali ID

source: Merchant IDENT terminal ID
et: Kaupmehe IDENT terminali ID

source: Preferred locale
et: Eelistatud keel

source: RFC-2616 format locale. Like et,en,ru
et: RFC-2616 formaadis keel. Nagu näiteks et,en,ru

source: Accepted currency by this gateway
et: Lubatud valuuta käesolevale makseviisile

source: Other currencies will be converted to accepted currency
et: Teistes valuutades tehtud tellimused konverteeritakse lubatud valuutaks

source: Setting [%s] is disabled. This may cause errors in the plugin
et: Seadistus [%s] on keelatud. See võib tekitada häireid pluginas

source: Enable logging
et: Luba logimine faili

source: Log level
et: Logimise tase

source: Request failed with response: %s
et: Päring ebaõnnestus. Vastus serverist: %s

source: Shop name on some reports
et: Poe nimetus teatud aruannetel

source: You canceled the payment
et: Te katkestasite maksmise

source: Cancel
et: Katkesta

source: Error occurred with the payment, please try again
et: Maksmisel tekkis tõrge, palun proovige uuesti

source: Show payment QR code
et: Näita makse QR koodi

source: On checkout page (may not work for everyone)
et: Kassa lehel (ei pruugi kõikide jaoks töötada)

source: On separate page after customer confirms order
et: Eraldi lehel peale kliendipoolset tellimuse kinnitamist

source: Cancel order & restore cart
et: Tühista tellimus ja taasta ostukorv

source: Connection to mTasku server failed with message: %s
et: Ühendus mTasku serverisse ebaõnnestus. Teade: %s

source: Transaction ID
et: Tehingu ID

source: Payment was successful
et: Makse on sooritatud

source: Thank you for the order, please click on the button to start the payment.
et: Tänan tellimuse eest! Maksmise alustamiseks klikkige nupul.

source: Continue
et: Edasi

source: Start payment
et: Alusta makset

source: Live account credentials can be obtained here
et: mTasku live konto kasutajatunnused on võimalik saada siit

source: Connection to mTasku server was successful
et: mTasku serveriga ühendumine õnnestus

source: Transaction could not be initialized
et: Tehingu alustamine ebaõnnestus

source: Payment message on receipt
et: Makse selgitus kviitungil

source: Default: %s, where %%s is replaced with order number
et: Vaikimisi: %s, kus %%s asendatakse tellimuse numbriga

source: Order %s fee
et: Tellimuse %s tasu

source: [TEST]
et: [testkonto]

source: [LIVE]
et: [päriskonto]

source: Live mode
et: Päriskonto

source: Test mode
et: Testkonto

source: Payment method mode
et: Makseviisi töörežiim

source: mTasku payment for WooCommerce
et: mTasku kaardimaaksed WooCommercele

source: Adds mobile wallet mTasku payment method to Woocommerce
et: mTasku annab klientidele võimaluse maksta oma mobiilse rahakotiga.

source: Customers can pay with any payment card registered in the mTasku smartphone app
et: Kliendid saavad ostu eest tasuda oma mTasku rakenduses registreeritud maksekaardiga

source: https://wiki.e-abi.ee/dokid/010430/en/AllowPOSTGETUserAgentcontentstob.html
et: https://wiki.e-abi.ee/dokid/010430/et/LubaPOSTGETUserAgentmuutujatesis.html

source: Allow POST/GET/UserAgent contents to be logged to the log file
et: Luba POST/GET/UserAgent muutujate sisu logimine logifaili

source: I confirm that I have read the %s and agree to them
et: Kinnitan, et olen lugenud läbi %s ja nõustun nendega

source: Log level DEBUG is required for this setting to be enabled
et: Logimise tase peab käesoleva seadistuse kasutamiseks olema vähemalt DEBUG

source: terms and conditions
et: tingimused

source: Open mTasku app
et: Ava mTasku app

source: With mTasku, you can pay in e-shop without logging in to the Internet bank and entering bank card data. Move your plastic cards to your phone: www.mtasku.ee
et: mTaskuga saab e-poes maksta internetipanka sisselogimata ning pangakaardi andmeid sisestamata. Koli oma plastikkaardid telefoni: www.mtasku.ee
